## 데이터확인

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('score.csv')

In [4]:
df

   지원번호   이름    키   학교
0     0  채치수  197  북산고
1     1  정대만  184  북산고
2     2  송태섭  160  북산고
3     3  서태웅  178  북산고

### 인덱스값 변경

In [8]:
df.index=(['1번','2번','3번','4번'])

In [9]:
df

    지원번호   이름    키   학교
1번     0  채치수  197  북산고
2번     1  정대만  184  북산고
3번     2  송태섭  160  북산고
4번     3  서태웅  178  북산고

### 인덱스 이름 변경

In [12]:
df.index.name='번호'

In [13]:
df

    지원번호   이름    키   학교
번호
1번     0  채치수  197  북산고
2번     1  정대만  184  북산고
3번     2  송태섭  160  북산고
4번     3  서태웅  178  북산고

### 인덱스 삭제

In [14]:
df.drop('지원번호', axis=1, inplace=True)

In [15]:
df

     이름    키   학교
번호
1번  채치수  197  북산고
2번  정대만  184  북산고
3번  송태섭  160  북산고
4번  서태웅  178  북산고

### Column 열 추가

In [26]:
df = df.assign(체중=['98', '60', '70', '87'])

In [27]:
df

     이름    키   학교  체중
번호
1번  채치수  197  북산고  98
2번  정대만  184  북산고  60
3번  송태섭  160  북산고  70
4번  서태웅  178  북산고  87

### 행삭제

In [29]:
df.drop('3번', axis=0, inplace=True)
df

     이름    키   학교  체중
번호
1번  채치수  197  북산고  98
2번  정대만  184  북산고  60
4번  서태웅  178  북산고  87